package com.company;

public class Main {

    public static void main(String[] args) {
	    // Задание 4: Дана скобочная последовательность : [((())()(())]]
        // - Можно ли считать эту последовательность правильной?
        //- Если ответ на предыдущий вопрос “нет” - то что необходимо в
        // ней изменить, чтоб она стала правильной?

        //Ответ: данная скобочная последовательность не является правильной
        // по первому условию: количество открывающихся и закрывающихся скобок
        // одного вида не совпадает. Для приведения последовательности к
        // правильному виду необходимо ] заменить на ).
        // Итоговый результат: [((())()(()))]
    }
}
